Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseWallsweepsForCurtainWall
Switching element type to Curtain Family. All Wall Sweeps or Reveals hosted by this instance will be deleted.

Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseInsertsForCurtainWall
Switching element type to Curtain element. All inserts in the element will be deleted.

Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseFaceSplitsForCurtainWall
Switching element type to Curtain Family. All Split Face Regions in the element will be deleted.

Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseDimensionsForCurtainWall
Switching wall type to Family Curtain Wall. All Dimension References to the side faces of the Wall will be deleted.

Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseCurtainWallData
Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost.

Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures
Failures about LooseDimension.